geo_pic/app/controllers/places_controller.rb

INSERT INTO "places" ("location") VALUES ($1) RETURNING "id"  [["location", "austin texas"]]
---
  def create
    @place = Place.create(:location => params[:search])