app/controllers/places_controller.rb

SELECT "places".* FROM "places"
---
  def index
   @places = Places.all

SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @place = Place.find(params[:id])

INSERT INTO "places" ("location") VALUES ($1) RETURNING "id"  [["location", "washington dc"]]
---
  def create
    @place = Place.create(:location => params[:search])

SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @place = Place.find(params[:id])

SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", 8]]
UPDATE "places" SET "location" = $1 WHERE "places"."id" = $2  [["location", "St. Louis"], ["id", 8]]
---
  def update
    @place = Place.find(params[:id])
    if @place.update (place_params)

SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "places" WHERE "places"."id" = $1  [["id", 6]]
---
  def destroy
    @place = Place.find(params[:id])
    @place.destroy