app/controllers/users_controller.rb

SELECT "places".* FROM "places"
---
  def show
    @places = Place.all